---
title: 숙련기술전수-심화 1일차
date: 2022-11-14 20:18:34
tags:
---

## 암호학

### 대칭 키

- 암/복호화시 키가 같음
- DES 3DES AES
- 블록 암호화
- XOR 연산

### 비대칭 키

- 암/복호화 키가 서로 다름
- DH
  - 상호 협약
  - 세션 키
- RSA (PKR)
  - 전자 서명
  - 3자 인증 기관 (CA)
    - 클라이언트는 CA 목록을 가지고 있음
    - 브라우저 도구 security
    - window
      ![Untitled](images/숙련기술전수-심화-1일차/Untitled.png)
  - RSSid
    - 인증 과정
      ![Untitled.png](images/숙련기술전수-심화-1일차/Untitled%201.png)

### ASA 5505

- 미국에서 규제를 함 러시아, 중동에 K8 판매
- K8 : 데이터 암호화 스텐다드
- K9

---

## GRE-over-IPSEC

![Untitled](images/숙련기술전수-심화-1일차/Untitled%202.png)

Server → PC2

HQ 의 ip table에는 172.16.0.254/24가 없음

ISP에는 사설 IP 불가

= HQ → BR1 터널링

터널에 들어가면 GRE header를 붙임

GRE Src 2.2.2.2 Dst 3.3.3.3

보통 헤더길이는 24byte지만 GRE 헤더가 붙어 길이가 늘어나게 되고, mtu가 1500인 상태로 통신을 하게되면 패킷의 최대 길이인 1524byte를넘어 패킷 단편화가 발생한다.

이를 방지 하기 위해서는 mtu를 1467로 설정해 GRE헤더를 붙인 패킷의 단편화를 막는다

### ipsec vpn

- 유니캐스트 통신만 가능하다 = 동적 라우팅이 불가능하다.
- 때문에 순수 ipsec vpn을 사용하지 않음
- 1단계 : peer 인증
  - 통신 대상이 맞는지 확인
  - Encryption method
    - DES, 3DES, AES
  - Hash AL (데이터 변조 확인)
    - MD5, SHA
  - DH Group (세션 키 생성)
  - RSSid
- 2단계 : 데이터 암호화 (실제 ipsec)
  - 암호화의 범위에 따라 터널모드와 트렌스포트모드를 사용
  - 터널모드 : 헤더까지 암호화
  - 트렌스포트모드 : paylord만 암호화
  - ESP (대칭키 필요) → 1단계에서 사용한 세션키 사용

### 실습

- HQ

  ```bash
  [GRE Tunnel 설정]

  HQ#conf t
  Enter configuration commands, one per line.  End with CNTL/Z.
  HQ(config)#ip nat inside source static 192.168.10.1 2.2.2.2
  HQ(config)#no ip nat inside source static 192.168.10.1 2.2.2.2
  HQ(config)#do write
  HQ(config)#int tun0
  HQ(config-if)#ip addr 10.0.0.1 255.255.255.252
  HQ(config-if)#tunnel source lo 0
  HQ(config-if)#tunnel destination 3.3.3.3
  HQ(config-if)#tunnel mode gre ip
  HQ(config-if)#ip mtu 1476
  HQ(config-if)#exit
  HQ(config)#do show int tun0
  mtu 확인
  HQ(config)#ip route 172.16.0.0 255.255.255.0 tun0 10.0.0.2
  HQ(config)#int tun1
  HQ(config-if)#ip address 10.0.0.5 255.255.255.252o 0
  HQ(config-if)#tunnel destination 4.4.4.4
  HQ(config-if)#do show int tun1
  mtu 확인
  HQ(config-if)#exit
  HQ(config)#ip route 172.17.0.0 255.255.255.0 tun 1 10.0.0.6
  HQ(config)#end
  HQ#show ip route

  [IPSEC 설정]

  HQ#conf t
  HQ(config)#crypto isakmp policy 10
  HQ(config-isakmp)#encryption aes
  HQ(config-isakmp)#hash sha
  HQ(config-isakmp)#group 14
  HQ(config-isakmp)#authentication pre-share
  HQ(config-isakmp)#exit
  HQ(config)#crypto isakmp key cisco address 100.0.0.3
  HQ(config)#crypto ipsec transform-set TS esp-aes esp-sha-hmac
  HQ(cfg-crypto-trans)#mode tunnel
  HQ(cfg-crypto-trans)#exit
  HQ(config)#ip access-list extended GRE1
  HQ(config-ext-nacl)#permit gre host 2.2.2.2 host 3.3.3.3
  HQ(config-ext-nacl)#exit
  HQ(config)#crypto map IPSEC 10 ipsec-isakmp
  HQ(config-crypto-map)#set peer 100.0.0.3
  HQ(config-crypto-map)#set transform-set TS
  HQ(config-crypto-map)#match address GRE1
  HQ(config-crypto-map)#int s2/0
  HQ(config-if)#crypto map IPSEC
  HQ(config-if)#exit
  HQ(config)#ip access-list extended GRE2
  HQ(config-ext-nacl)#permit gre host 2.2.2.2 host 4.4.4.4
  HQ(config-ext-nacl)#exit
  HQ(config)#crypto map IPSEC 20 ipsec-isakmp
  HQ(config-crypto-map)#set peer 100.0.0.4
  HQ(config-crypto-map)#set transform-set TS
  HQ(config-crypto-map)#match address GRE2
  HQ(config-crypto-map)#end
  HQ#conf t
  HQ(config)#crypto isakmp key cisco address 100.0.0.4

  ```

- BR1

  ```bash
  [터널 설정]

  BR1#conf t
  BR1(config)#int tun 0
  BR1(config-if)#ip address 10.0.0.2 255.255.255.252
  BR1(config-if)#tunnel source lo 0
  BR1(config-if)#tunnel destination 2.2.2.2
  {BR1(config-if)#tunnel mode gre ip
  BR1(config-if)#ip mtu 1476} #기본값이라 굳이 설정하지 않아도 된다
  BR1(config)#ip route 192.168.10.0 255.255.255.0 tun0 10.0.0.1
  BR1(config)#ip route 192.168.20.0 255.255.255.0 tun0 10.0.0.1
  BR1(config)#ip route 172.17.0.0 255.255.255.0 tun0 10.0.0.5
  BR1(config)#ip route 10.0.0.4 255.255.255.252 tun0 10.0.0.1

  [IPSEC 설정]

  BR1(config)#crypto isakmp policy 10
  BR1(config-isakmp)#enc aes
  BR1(config-isakmp)#ha sha
  BR1(config-isakmp)#gr 14
  BR1(config-isakmp)#authentication pre-share
  BR1(config-isakmp)#exit
  BR1(config)#crypto ipsec transform-set TS esp-aes esp-sha-hmac
  BR1(cfg-crypto-trans)#exit
  BR1(config)#crypto isakmp key cisco address 100.0.0.2
  BR1(config)#ip access-list extended GRE1
  BR1(config-ext-nacl)#permit gre host 3.3.3.3 host 2.2.2.2
  BR1(config-ext-nacl)#exit
  BR1(config)#crypto map IPSEC 10 ipsec-isakmp
  BR1(config-crypto-map)#set peer 100.0.0.2
  BR1(config-crypto-map)#set transform-set TS
  BR1(config-crypto-map)#match address GRE1
  BR1(config-crypto-map)#int s2/0
  BR1(config-if)#crypto map IPSEC

  ```

- BR2

  ```bash
  [터널 설정]

  BR2#conf t
  BR2(config)#int tun0
  BR2(config-if)#ip addr
  BR2(config-if)#ip addr 10.0.0.6 255.255.255.252
  BR2(config-if)#tunnel source lo 0
  BR2(config-if)#tunnel destination 2.2.2.2
  BR2(config-if)#exit
  BR2(config)#ip route 192.168.10.0 255.255.255.0 tun0 10.0.0.5
  BR2(config)#ip route 192.168.20.0 255.255.255.0 tun0 10.0.0.5
  BR2(config)#ip route 172.16.0.0 255.255.255.0 tun0 10.0.0.5
  BR2(config)#ip route 10.0.0.0 255.255.255.252 tun0 10.0.0.5

  [IPSEC 설정]

  BR2(config)#cry
  BR2(config)#crypto isakmp policy 10
  BR2(config-isakmp)#encryption aes
  BR2(config-isakmp)#ha sha
  BR2(config-isakmp)#gr 14
  BR2(config-isakmp)#au pre
  BR2(config-isakmp)#exit
  BR2(config)#crypto isakmp key cisco address 100.0.0.2
  BR2(config)#crypto ipsec transform-set TS esp-aes esp-sha-hmac
  BR2(cfg-crypto-trans)#exit
  BR2(config)#ip access-list extended GRE2
  BR2(config-ext-nacl)#permit gre host 4.4.4.4 host 2.2.2.2
  BR2(config-ext-nacl)#exit
  BR2(config)#crypto map IPSEC 10 ipsec-isakmp
  BR2(config-crypto-map)#set peer 100.0.0.2
  BR2(config-crypto-map)#set transform-set TS
  BR2(config-crypto-map)#match address GRE2
  BR2(config-crypto-map)#int s2/0
  BR2(config-if)#crypto map IPSEC

  ```

### gre over ipsec vpn

시간이 없어 1일차에 진행하지 못했다.
